package com.handong.oodp;

public class Menu {
	String main = "1. 로그인\n2. 회원등록\n0. 종료 \n\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Number = "\n숫자만 입력하세요.";
	String Manager = "****관리자메뉴****\n1. 고용관리\n2. 계정관리\n3. 근무관리\n4. 전직원 조회\n5. 환자 관리\n0. 로그아웃\n\n원하는 메뉴의 번호를 입력하세요 : " ;
	String Work = "\n\n****근무 관리****\n1. 근무 일정 관리\n2. 회진 관리\n3. 라운딩 관리\n4. 근무교대 기록 관리\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String CWork = "\n\n****근무 관리****\n1. 근무 일정 관리\n2. 회진 관리(의사전용)\n3. 라운딩 관리(간호사전용)\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Task = "\n\n****일정 관리****\n1. 전체 일정 확인\n2. 일정 추가\n3. 일정 삭제\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String DRounding = "\n\n****회진 관리****\n1. 전체 일정 확인\n2. 일정 추가\n3. 일정 삭제\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String NRounding = "\n\n****라운딩 관리****\n1. 전체 일정 확인\n2. 일정 추가\n3. 일정 삭제\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Shift = "\n\n****근무 교대 기록 관리****\n1. 전체 기록 확인\n2. 기록 추가\n3. 기록 삭제\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Employment = "\n\n**** 고용 관리 ****\n1. 직원 추가\n2. 직원 삭제\n3. 직원 수 조회\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String EmplTotal = "\n\n****직원 수 조회****\n1. 현재 의사 수 조회\n2. 현재 간호사 수 조회\n3. 현재 간호조무사 수 조회\n0. 처음으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Add = "\n\n**** 추가하기 ****\n1. 의사 추가\n2. 간호사 추가\n3. 간호조무사 추가\n0. 처음으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Delete = "\n\n**** 삭제하기 ****\n1. 의사 삭제\n2. 간호사 삭제\n3. 간호조무사 삭제\n0. 처음으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Account = "\n\n**** 계정관리 ****\n1. 회원등록\n2. 회원수정\n3. 회원삭제\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Employee = "\n\n**** 직원메뉴 ****\n1. 일정 관리\n2. 환자관리\n0. 로그아웃\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Patient = "\n\n****환자 관리****\n1. 전체 환자 확인\n2. 환자 나이(min, max) 확인\n3. 환자 추가\n4. 환자 삭제\n4. 응급환자로 전환\n5. 일반환자로 전환\n6. 환자 정보 변경\n0. 뒤로가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String NotN = "\n간호사만 이용할 수 있는 기능입니다.";
	String NotD = "\n의사만 이용할 수 있는 기능입니다.";
}
