package com.handong.oodp;

public class Menu {
	String main = "1. 로그인\n2. 회원등록\n0. 종료 \n\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Number = "숫자만 입력하세요.\n\n";
	String Manager = "**** 병원 관리 프로그램 ****\n1. 고용관리\n2. 계정관리\n3. 일정관리\n4. 전직원 조회\n5. 환자 관리\n0. 로그아웃\n\n원하는 메뉴의 번호를 입력하세요 : " ;
	String Schedule = "\n\n****일정 관리****\n1. 전체 일정 확인\n2. 일정 추가\n3. 일정 삭제\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Employment = "\n\n**** 고용 관리 ****\n1. 의사/간호사 추가\n2. 의사/간호사 삭제\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Add = "\n\n**** 추가하기 ****\n1. 의사 추가\n2. 간호사 추가\n0. 처음으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Delete = "\n\n**** 삭제하기 ****\n1. 의사 삭제\n2. 간호사 삭제\"\n0. 처음으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Account = "\n\n**** 계정관리 ****\n1. 회원등록\n2. 회원수정\n3. 회원삭제\n0. 이전으로 돌아가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Employee = "\n\n**** 직원메뉴 ****\n1. 일정 관리\n2. 환자관리\n0. 로그아웃\n\n원하는 메뉴의 번호를 입력하세요 : ";
	String Patient = "\n\n****환자 관리****\n1. 전체 환자 확인\n2. 환자 추가\n3. 환자 삭제\n4. 환자 나이(min,max) 확인\n0. 뒤로가기\n\n원하는 메뉴의 번호를 입력하세요 : ";
}
